import css from "./Article.module.css";
import SearchForm from "../../components/SearchForm/SearchForm";
import Banner from "../../imgs/Article/article-banner.jpeg";
import ArrowRight from "../../icons/sm-arrow-right.svg";
import ArrowLeft from "../../icons/sm-arrow-left.svg";

const Article = () => {
  return (
    <section className={css.article}>
      <Container>
        <SearchForm placeholder={"Шоколадний торт з квітами"} type={2} />
        <div className={css["article-block"]}>
          <img
            className={css.article__banner}
            src={Banner}
            alt={"фото круасанів"}
          />
          <h1 className={css.article__title}>
            Як приготувати справжній французький круасан
          </h1>
          <p className={css.article__desc}>
            Круасани на сніданок – це класика. Що може бути смачніше за свіжий
            гарячий невагомий круасан? Гурман підготував для тебе рецепт
            справжнього французького круасана. ДИВИСЬ: Оладки на сніданок: ТОП-5
            кращих рецептів Рецепт круасана <br />
            - 20 г свіжих дріжджів (або 5 гр сухих) <br />
            - 500 г білого хлібного борошна
            <br />
            - 10 г солі
            <br />
            - 50 г цукру
            <br />
            - 1 велике яйце
            <br />
            - 125 г холодного молока
            <br />
            - 125 г води
            <br />
            - 200 г несолоного вершкового масла (з холодильника)
            <br />
            - 1 яйце, збите з щіпкою солі, для глазурі
            <br />
          </p>
          <p className={css.article__desc}>
            Як приготувати: Добре розітри дріжджі в борошні, додай сіль і цукор.
            Слідом додай яйце, молоко та воду - ретельно перемішай до однорідної
            маси й виміси тісто 3-4 хвилини. Сформуй кулю і зроби хрестоподібний
            надріз зверху; злегка присип форму для тіста борошном і відправ у
            неї тісто не менше, ніж на 2 години, а краще на всю ніч (12 годин)
            постав форму в холодильник, накривши її плівкою.
          </p>
          <p className={css.article__desc}>
            Посипавши злегка робоче місце борошном, виклади на нього виросле
            тісто. Розгорни його в місці надрізу в 4 сторони й злегка розкачай.
            Намагайся витримати квадратну форму. Розгорни тісто ромбом і в його
            середину виклади вершкове масло товщиною близько 1 см. Масло
            попередньо розкачай на папері від упаковки масла, накривши плівкою.
            Закрий масло рештою тіста з боків ромба та починай розгортати до
            60-70 см, звертаючи увагу на товщину шару - вона повинна бути
            рівномірною по всій площі. За час розкочування тіста підніми й
            злегка повертай (не перевертаючи) його кілька разів. Склади тісто в
            три шари, зробивши позначку на верхньому шарі. Поклади тісто в пакет
            і відправ його на 20-30 хвилин у холодильник. Діставши тісто з
            холодильника, виклади його позначкою догори і короткою стороною до
            себе. Розкачай у прямокутник і знову склади його в три рази; відправ
            на відпочинок у холодильник на 20-30 хвилин. Повторюємо процедуру ще
            один раз – загалом 3 рази! Після третьої "заморозки" розкачай тісто
            в прямокутник 30х75 см і завтовшки 4 мм. Гострим ножем підрівняй
            краї, шар розділи на 2 частини уздовж і почни вирізати трикутники
            розміром 15х15х9 см. Основу надріж, щоб при випічці круасан вигнувся
            і набув своєї знаменитої форми. Формуй круасан, починаючи скручувати
            його з основи. Глазуруй круасан яєчною сумішшю з сіллю та дай
            підійти 2 години. Намаж ще раз глазур'ю круасан. Намагайся змазувати
            круасан тільки по верхньому шару, не чіпаючи листкових боків, щоб
            уникнути їх склеювання. Розігрій духовку до 220-230 градусів за
            Цельсієм. Випікай круасан 18-20 хвилин до золотавого кольору. Остуди
            на решітці. <br />{" "}
            <span className={css["article__text--bold"]}>Смачного!</span>
          </p>
          <ul className={css.article__list}>
            <li className={css.article__item}>
              <div className={css["article__wrapper"]}>
                <img
                  className={css.article__img}
                  src={ArrowLeft}
                  alt="стрілка вліво"
                />
                <h4 className={css.article__subtext}>Попередня стаття</h4>
              </div>
              <img
                className={css.article__img}
                src={"lala"}
                alt="прев'ю минулої статті"
              />
              <h3 className={css.article__subtitle}>
                Кращі кондитерські Києва
              </h3>
            </li>
            <li className={css.article__item}>
              <div className={css["article__wrapper"]}>
                <h4 className={css.article__subtext}>Наступна стаття</h4>
                <img
                  className={css.article__img}
                  src={ArrowRight}
                  alt="стрілка вправо"
                />
              </div>
              <img
                className={css.article__img}
                src={Article2}
                alt="превь'ю наступної статті"
              />
              <h3 className={css.article__subtitle}>
                Рецепти шоколаду без цукру
              </h3>
            </li>
          </ul>
        </div>
      </Container>
    </section>
  );
};

export default Article;
